I also noticed that when the value of nested_virtualization is set to false, the parameter nested_virtualization is not sent in the VM creation request: 
```
# outscale_vm.outscale_vm2 will be created
  + resource "outscale_vm" "outscale_vm2" {
      + admin_password                 = (known after apply)
      + architecture                   = (known after apply)
      + bsu_optimized                  = (known after apply)
      + client_token                   = (known after apply)
      + deletion_protection            = (known after apply)
      + hypervisor                     = (known after apply)
      + id                             = (known after apply)
      + image_id                       = "ami-5e4d3823"
      + is_source_dest_checked         = (known after apply)
      + keypair_name                   = "New-IN1-KP"
      + launch_number                  = (known after apply)
      + nested_virtualization          = false
      + net_id                         = (known after apply)
      + os_family                      = (known after apply)
      + performance                    = (known after apply)
      + placement_subregion_name       = "in-west-1a"
      + placement_tenancy              = "dedicated"
      + private_dns_name               = (known after apply)
      + private_ip                     = (known after apply)
      + product_codes                  = (known after apply)
      + public_dns_name                = (known after apply)
      + public_ip                      = (known after apply)
      + request_id                     = (known after apply)
      + reservation_id                 = (known after apply)
      + root_device_name               = (known after apply)
      + root_device_type               = (known after apply)
      + security_groups                = (known after apply)
      + state                          = "running"
      + state_reason                   = (known after apply)
      + subnet_id                      = (known after apply)
      + user_data                      = (known after apply)
      + vm_id                          = (known after apply)
      + vm_initiated_shutdown_behavior = (known after apply)
      + vm_type                        = "tinav1.c2r2p2"

      + block_device_mappings_created {
          + bsu         = (known after apply)
          + device_name = (known after apply)
        }

      + nics {
          + account_id                 = (known after apply)
          + delete_on_vm_deletion      = (known after apply)
          + description                = (known after apply)
          + device_number              = (known after apply)
          + is_source_dest_checked     = (known after apply)
          + link_nic                   = (known after apply)
          + link_public_ip             = (known after apply)
          + mac_address                = (known after apply)
          + net_id                     = (known after apply)
          + nic_id                     = (known after apply)
          + private_dns_name           = (known after apply)
          + secondary_private_ip_count = (known after apply)
          + security_group_ids         = (known after apply)
          + security_groups            = (known after apply)
          + state                      = (known after apply)
          + subnet_id                  = (known after apply)

          + private_ips {
              + is_primary       = (known after apply)
              + link_public_ip   = (known after apply)
              + private_dns_name = (known after apply)
              + private_ip       = (known after apply)
            }
        }

      + tags {
          + key   = "name"
          + value = "outscale_vm2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Here's the request sent in the logs:

```
Generic HTTP information extracted : method: POST, path: /api/v1/CreateVms, body: {"BootOnCreation":true,"BsuOptimized":false,"DeletionProtection":false,"ImageId":"ami-5e4d3823","KeypairName":"New-IN1-KP","MaxVmsCount":1,"MinVmsCount":1,"Placement":{"SubregionName":"in-west-1a","Tenancy":"dedicated"},"VmType":"tinav1.c2r2p2"}#012, query-string:  {"version":"1.24.0","release":"","commit":"af3dd95b","request_id":"cc83fc5a-bf7a-41b9-a008-dad74c909a9e"}
```

Not sure this is a bug since the default value of nested_virtualization is false by default. But it's worth mentioning. 